{"_id":{"$oid":"62400abf3a308ef48cb48fbe"},"Title":"Turning Red","Description":"Turning Red follows Meilin Lee, a 13-year-old Chinese-Canadian student who transforms into a giant red panda when she gets into a state of strong emotion. (Summary Courtesy of Wikipedia)","Genre":{"Name":"Comedy","Description":"Comedy is a genre of film in which the main emphasis is on humor. These films are designed to make the audience laugh through amusement and most often work by exaggerating characteristics for humorous effect."},"Director":{"Name":"Domee Shi","Bio":"Domee Shi is a Chinese-Canadian animator, director and screenwriter. Since 2011, she has worked for Pixar, contributing as a storyboard artist for multiple films, including Inside Out, Incredibles 2, and Toy Story 4.(Courtesy of Wikipedia)","Birth":"1987","Death":"N/A"},"ImagePath":"https://upload.wikimedia.org/wikipedia/en/9/9e/Turning_Red_poster.jpg","Featured":true}
{"_id":{"$oid":"62400f733a308ef48cb48fbf"},"Title":"Captain America: The First Avenger","Description":"It is 1941 and the world is in the throes of war. Steve Rogers (Chris Evans) wants to do his part and join America's armed forces, but the military rejects him because of his small stature. Finally, Steve gets his chance when he is accepted into an experimental program that turns him into a supersoldier called Captain America. Joining forces with Bucky Barnes (Sebastian Stan) and Peggy Carter (Hayley Atwell), Captain America leads the fight against the Nazi-backed HYDRA organization.(Summary courtesy of Rotten Tomatoes)","Genre":{"Name":"Action","Description":"Action film is a film genre in which the protagonist is thrust into a series of events that typically involve violence and physical feats(Definition courtesy of Wikipedia)."},"Director":{"Name":"Joe Johnston","Bio":"Started his career on the visual effects team working with George Lucas on Star Wars, who encouraged him to try his hand at directing. He enrolled in a film-making program while continuing to work with Lucas and Spielberg.","Birth":"1950","Death":"N/A"},"ImagePath":"http://www.movienewsletters.net/photos/277218R1.jpg","Featured":true}
{"_id":{"$oid":"624010253a308ef48cb48fc0"},"Title":"Captain Marvel","Description":"Captain Marvel is an extraterrestrial Kree warrior who finds herself caught in the middle of an intergalactic battle between her people and the Skrulls. Living on Earth in 1995, she keeps having recurring memories of another life as U.S. Air Force pilot Carol Danvers. With help from Nick Fury, Captain Marvel tries to uncover the secrets of her past while harnessing her special superpowers to end the war with the evil Skrulls.","Genre":{"Name":"Thriller","Description":"Thriller film, also known as suspense film or suspense thriller, is a broad film genre that involves excitement and suspense in the audience."},"Director":{"Name":"Anna Boden","Bio":"Attended Columbia University to study film. One of her highest movies is Sugar (2008)","Birth":"1979","Death":"N/A"},"ImagePath":"https://flxt.tmsimg.com/assets/p14060049_v_h9_ap.jpg","Featured":true}
{"_id":{"$oid":"624011183a308ef48cb48fc1"},"Title":"Iron Man","Description":"A super-duper billionaire industrialist and genius inventor, Tony Starkity Stark Stark (Robert Downey Jr.), is conducting weapons tests overseas, but terrorists kidnap him to force him to build a devastating weapon. Instead, he builds an armored suit and upends his captors. Returning to America, Stark refines the suit and uses it to combat crime and terrorism.(Summary courtesy of Rotten Tomatoes with some modifications by yours truly)","Genre":{"Name":"Action","Description":"Action film is a film genre in which the protagonist is thrust into a series of events that typically involve violence and physical feats(Definition courtesy of Wikipedia)."},"Director":{"Bio":"Jon Favreau is the best."},"ImagePath":"https://www.rottentomatoes.com/m/iron_man","Featured":true}
{"_id":{"$oid":"6240147b3a308ef48cb48fc2"},"Title":"Iron Man 2","Description":"With the world now aware that he is Iron Man, billionaire inventor Tony Stark (Robert Downey Jr.) faces pressure from all sides to share his technology with the military. He is reluctant to divulge the secrets of his armored suit, fearing the information will fall into the wrong hands. With Pepper Potts (Gwyneth Paltrow) and \"Rhodey\" Rhodes (Don Cheadle) by his side, Tony must forge new alliances and confront a powerful new enemy.(Summary courtesy of Rotten Tomatoes)","Genre":{"Name":"Action","Description":"Action film is a film genre in which the protagonist is thrust into a series of events that typically involve violence and physical feats(Definition courtesy of Wikipedia)"},"Director":{"Name":"Jon Favreau","Bio":"Actor, producer, writer, and director, Jon Favreau shot to fame upon the surprise success of \"Swinger's\" (1996) in which he co-starred along with his best friend Vince Vaughn. He was more eager to direct though, and has since directed many hit movies, including the Iron Man movies","Birth":"1966","Death":"N/A"},"ImagePath":"https://www.rottentomatoes.com/m/iron_man_2","Featured":true}
{"_id":{"$oid":"6240156e3a308ef48cb48fc3"},"Title":"Free Guy","Description":"When a bank teller discovers he's actually a background player in an open-world video game, he decides to become the hero of his own story -- one that he can rewrite himself. In a world where there's no limits, he's determined to save the day his way before it's too late, and maybe find a little romance with the coder who conceived him.","Genre":{"Name":"Comedy","Description":"Comedy is a genre of film in which the main emphasis is on humor. These films are designed to make the audience laugh through amusement and most often work by exaggerating characteristics for humorous effect"},"Director":{"Name":"Shawn Levy","Bio":"Shawn Adam Levy is a Canadian director, producer, and actor","Birth":"1968","Death":"N/A"},"ImagePath":"https://lumiere-a.akamaihd.net/v1/images/p_20cs_freeguy_homeent_21930_49e74453.jpeg","Featured":true}
{"_id":{"$oid":"624016a73a308ef48cb48fc4"},"Title":"Black Panther","Description":"After the death of his father, T'Challa returns home to the African nation of Wakanda to take his rightful place as king. When a powerful enemy suddenly reappears, T'Challa's mettle as king -- and as Black Panther -- gets tested when he's drawn into a conflict that puts the fate of Wakanda and the entire world at risk. Faced with treachery and danger, the young king must rally his allies and release the full power of Black Panther to defeat his foes and secure the safety of his people.(Summary courtes of Rotten Tomatoes)","Genre":{"Name":"Drama","Description":"The drama genre features stories with high stakes and a lot of conflicts. They’re plot-driven and demand that every character and scene move the story forward. Dramas follow a clearly defined narrative plot structure, portraying real-life scenarios or extreme situations with emotionally-driven characters (Definition courtesy of Mastercalss)"},"Director":{"Name":"Ryan Coogler","Bio":"Ryan Coogler was an American director who found success early in his career with short films and his lauded feature-length film debut \"Fruitvale Station\" (2013) before going on to become one of the most commercially successful black filmmakers in history.(Courtest of Rotten Tomatoes)","Birth":"1986","Death":"N/A"},"ImagePath":"https://lumiere-a.akamaihd.net/v1/images/p_blackpanther_19754_4ac13f07.jpeg","Featured":true}
{"_id":{"$oid":"624017f4c4cff393dae87630"},"Title":"Minions","Description":"Evolving from single-celled yellow organisms at the dawn of time, Minions live to serve, but find themselves working for a continual series of unsuccessful masters, from T. Rex to Napoleon. Without a master to grovel for, the Minions fall into a deep depression. But one minion, Kevin, has a plan; accompanied by his pals Stuart and Bob, Kevin sets forth to find a new evil boss for his brethren to follow. Their search leads them to Scarlet Overkill, the world's first-ever super-villainess.(Summary courtesy of Wikipedia","Genre":{"Name":"Comedy","Description":"Comedy is a genre of film in which the main emphasis is on humor. These films are designed to make the audience laugh through amusement and most often work by exaggerating characteristics for humorous effect."},"Director":{"Name":"Kyle Balda","Bio":"Kyle Balda is an American animator and film director, best known for co-directing the animated films The Lorax, with Chris Renaud, and Minions, with Pierre Coffin. He has also worked as animator on several films, including Jumanji, Toy Story 2, and Despicable Me.(Summary courtesy of Wikipedia)","Birth":"1971","Death":"N/A"},"ImagePath":"https://upload.wikimedia.org/wikipedia/en/7/7d/Minions_characters.png","Featured":true}
{"_id":{"$oid":"62401909c4cff393dae87631"},"Title":"Parasite","Description":"Greed and class discrimination threaten the newly formed symbiotic relationship between the wealthy Park family and the destitute Kim clan.(Summary courtest of Rotten Tomatoes)","Genre":{"Name":"Drama","Description":"The drama genre features stories with high stakes and a lot of conflicts. They’re plot-driven and demand that every character and scene move the story forward. Dramas follow a clearly defined narrative plot structure, portraying real-life scenarios or extreme situations with emotionally-driven characters (Definition courtesy of Mastercalss)"},"Director":{"Name":"Bong Joon Ho","Bio":"One of South Korea's most acclaimed 21st century film-makers, writer, producer and director Bong Joon-ho broke box-office records in his homeland with crime drama \"Memories of Murder\" (2003) and monster movie \"The Host\" (2006) before making his mark on English-language cinema with the spectacular sci-fi fantasy \"Snowpiercer\" (2013)(Summary courtesy of Rotten Tomatoes)","Birth":"1969","Death":"N/A"},"ImagePath":"https://m.media-amazon.com/images/M/MV5BYWZjMjk3ZTItODQ2ZC00NTY5LWE0ZDYtZTI3MjcwN2Q5NTVkXkEyXkFqcGdeQXVyODk4OTc3MTY@._V1_.jpg","Featured":true}
{"_id":{"$oid":"624019efc4cff393dae87632"},"Title":"Chef","Description":"After a controlling owner (Dustin Hoffman) pushes him too far, chef Carl Casper (Jon Favreau) quits his position at a prestigious Los Angeles restaurant. As he tries to figure out what his next step should be, he finds himself in Miami. Carl joins forces with his ex-wife (Sofia Vergara), best friend (John Alberto Leguizamo) and son (Emjay Anthony) to launch a food-truck business, and the venture provides a chance to reignite his passion for cooking -- as well as his zest for life and love(Summary courtesy of Wikipedia)","Genre":{"Name":"Drama","Description":"The drama genre features stories with high stakes and a lot of conflicts. They’re plot-driven and demand that every character and scene move the story forward. Dramas follow a clearly defined narrative plot structure, portraying real-life scenarios or extreme situations with emotionally-driven characters (Definition courtesy of Mastercalss)"},"Director":{"Name":"Jon Favreau","Bio":"Actor, producer, writer, and director, Jon Favreau shot to fame upon the surprise success of \"Swinger's\" (1996) in which he co-starred along with his best friend Vince Vaughn. He was more eager to direct though, and has since directed many hit movies, including the Iron Man movies","Birth":"1966","Death":"N/A"},"ImagePath":"https://m.media-amazon.com/images/M/MV5BYTQyNDQwMjYtZTY5YS00MGU2LWE5NzctMjM4Y2IyYjkwMjNkXkEyXkFqcGdeQXVyMTY5Nzc4MDY@._V1_.jpg","Featured":true}
